In [17]:
# .join() combines dfs based on their indices
# .merge() combines dfs based on common columns or indices
# .concat() combines dfs along an axis, or if they are of the same structure

In [18]:
import pandas as pd
import numpy as np

In [3]:
class1 = pd.read_csv('class1.csv') # class of year 2005
class2 = pd.read_csv('class2.csv') # class of year 2006

In [51]:
class1

      Name Sex  Age  Height  Weight
0   Alfred   M   14    69.0   112.5
1    Alice   F   13    56.5    84.0
2  Barbara   F   13    65.3    98.0
3    Carol   F   14    62.8   102.5

In [52]:
class2

      Name Sex  Age  Height  Weight
0  Jeffrey   M   13    62.5    84.0
1     John   M   12    59.0    99.5
2    Joyce   F   11    51.3    50.5
3     Judy   F   14    64.3    90.0

In [19]:
class_combined = pd.concat([class1, class2], ignore_index = True)

In [20]:
class_combined

      Name Sex  Age  Height  Weight
0   Alfred   M   14    69.0   112.5
1    Alice   F   13    56.5    84.0
2  Barbara   F   13    65.3    98.0
3    Carol   F   14    62.8   102.5
4  Jeffrey   M   13    62.5    84.0
5     John   M   12    59.0    99.5
6    Joyce   F   11    51.3    50.5
7     Judy   F   14    64.3    90.0

In [25]:
# Multiindex to distinguish where each row came from

class_combined = pd.concat([class1, class2], keys = ['2005', '2006'])

In [26]:
class_combined

           Name Sex  Age  Height  Weight
2005 0   Alfred   M   14    69.0   112.5
     1    Alice   F   13    56.5    84.0
     2  Barbara   F   13    65.3    98.0
     3    Carol   F   14    62.8   102.5
2006 0  Jeffrey   M   13    62.5    84.0
     1     John   M   12    59.0    99.5
     2    Joyce   F   11    51.3    50.5
     3     Judy   F   14    64.3    90.0

In [28]:
# accessing rows of class of year 2005

class_combined.loc['2005']

      Name Sex  Age  Height  Weight
0   Alfred   M   14    69.0   112.5
1    Alice   F   13    56.5    84.0
2  Barbara   F   13    65.3    98.0
3    Carol   F   14    62.8   102.5

In [29]:
# Accessing rows of class of year 2005

class_combined.loc['2006']

      Name Sex  Age  Height  Weight
0  Jeffrey   M   13    62.5    84.0
1     John   M   12    59.0    99.5
2    Joyce   F   11    51.3    50.5
3     Judy   F   14    64.3    90.0

In [43]:
class_combined = pd.concat([class1, class2], ignore_index = True)

**Inserting a row into a dataframe**

In [45]:
new_student = {'Name': 'Lizah', 'Sex': 'F', 'Age': 16, 'Height': 115, 'Weight': 90}

In [46]:
class_combined = pd.concat([class_combined, pd.DataFrame([new_student])], ignore_index = True)

In [47]:
class_combined

      Name Sex  Age  Height  Weight
0   Alfred   M   14    69.0   112.5
1    Alice   F   13    56.5    84.0
2  Barbara   F   13    65.3    98.0
3    Carol   F   14    62.8   102.5
4  Jeffrey   M   13    62.5    84.0
5     John   M   12    59.0    99.5
6    Joyce   F   11    51.3    50.5
7     Judy   F   14    64.3    90.0
8    Lizah   F   16   115.0    90.0

**Replacing a row at an index in a DataFrame**

In [48]:
class_combined.loc[2] = ['Edwin', 'M', 15, 78.6, 88.9]

In [49]:
class_combined

      Name Sex  Age  Height  Weight
0   Alfred   M   14    69.0   112.5
1    Alice   F   13    56.5    84.0
2    Edwin   M   15    78.6    88.9
3    Carol   F   14    62.8   102.5
4  Jeffrey   M   13    62.5    84.0
5     John   M   12    59.0    99.5
6    Joyce   F   11    51.3    50.5
7     Judy   F   14    64.3    90.0
8    Lizah   F   16   115.0    90.0

**Inserting a new row at an index in a DataFrame**

In [5]:
new_student = ['Kris', 'F', 16, 67.5, 76.4]

In [6]:
import numpy as np

class2 = pd.DataFrame(np.insert(class2.values, 4, new_student, axis = 0), columns = class2.columns)

class2

      Name Sex Age Height Weight
0  Jeffrey   M  13   62.5   84.0
1     John   M  12   59.0   99.5
2    Joyce   F  11   51.3   50.5
3     Judy   F  14   64.3   90.0
4     Kris   F  16   67.5   76.4

**Merging and joining**

Types of merging DataFrames include: Inner join, Left join, Right join and Outer join

In [23]:
# 1. INNER JOIN

left = pd.DataFrame({'Players': ['Rogers', 'Bruno','Mbeumo'],
                     'Countries': ['England', 'Portugal', 'Cameroon']
                     })

right = pd.DataFrame({'Players': ['Rogers', 'Bruno','Mbeumo', 'Guler'],
                     'Surname': ['Morgan', 'Fernandes', 'Bryan', 'Arda']
                     })

In [24]:
left

  Players Countries
0  Rogers   England
1   Bruno  Portugal
2  Mbeumo  Cameroon

In [25]:
right

  Players    Surname
0  Rogers     Morgan
1   Bruno  Fernandes
2  Mbeumo      Bryan
3   Guler       Arda

In [26]:
pd.merge(left, right, how = 'inner', on = 'Players')

  Players Countries    Surname
0  Rogers   England     Morgan
1   Bruno  Portugal  Fernandes
2  Mbeumo  Cameroon      Bryan

In [43]:
# 2. LEFT JOIN

left = pd.DataFrame({'Players': ['Morgan Rogers', 'Bruno Fernandes','Bryan Mbeumo'],
                     'Countries': ['England', 'Portugal', 'Cameroon']
                     })

right = pd.DataFrame({'Players': ['Morgan Rogers', 'Morgan Rogers','Bruno Fernandes', 'Bruno Fernandes', 'Bryan Mbeumo'],
                      'Year': [2019, 2021, 2022, 2023, 2023],
                     'Medal': ['Bronze', 'Silver', 'Gold', 'Gold', 'Bronze']
                     })

In [40]:
left

           Players Countries
0    Morgan Rogers   England
1  Bruno Fernandes  Portugal
2     Bryan Mbeumo  Cameroon

In [41]:
right

           Players  Year   Medal
0    Morgan Rogers  2019  Bronze
1    Morgan Rogers  2021  Silver
2  Bruno Fernandes  2022    Gold
3  Bruno Fernandes  2023    Gold
4     Bryan Mbeumo  2023  Bronze

In [42]:
pd.merge(left, right, how = 'left', on = 'Players')

           Players Countries  Year   Medal
0    Morgan Rogers   England  2019  Bronze
1    Morgan Rogers   England  2021  Silver
2  Bruno Fernandes  Portugal  2022    Gold
3  Bruno Fernandes  Portugal  2023    Gold
4     Bryan Mbeumo  Cameroon  2023  Bronze

In [44]:
# 3. RIGHT JOIN

left = pd.DataFrame({'Players': ['Morgan Rogers', 'Bruno Fernandes','Bryan Mbeumo'],
                     'Countries': ['England', 'Portugal', 'Cameroon']
                     })

right = pd.DataFrame({'Players': ['Morgan Rogers', 'Bruno Fernandes'],
                      'Year': [2019, 2023],
                     'Medal': ['Bronze','Gold']
                     })

In [45]:
left

           Players Countries
0    Morgan Rogers   England
1  Bruno Fernandes  Portugal
2     Bryan Mbeumo  Cameroon

In [46]:
right

           Players  Year   Medal
0    Morgan Rogers  2019  Bronze
1  Bruno Fernandes  2023    Gold

In [49]:
pd.merge(left, right, how = 'right', on = 'Players')

           Players Countries  Year   Medal
0    Morgan Rogers   England  2019  Bronze
1  Bruno Fernandes  Portugal  2023    Gold

In [63]:
# 4. OUTER JOIN

product = pd.DataFrame({'Products': ['Coke', 'Pepsi', '7-up', 'Mirinda', 'Stoney'],
                     'Price': [20,30,25,25,35]})

product_update = pd.DataFrame({'Products': ['Coke', 'Pepsi', '7-up', 'Mirinda', 'Stoney', 'Diet Coke'],
                     'New_price': [20,30,25,25,35,45],
                     'Quantity': ['250ml', '300ml', '150ml', '100ml', '200ml', '250ml']})

In [64]:
product

  Products  Price
0     Coke     20
1    Pepsi     30
2     7-up     25
3  Mirinda     25
4   Stoney     35

In [65]:
product_update

    Products  New_price Quantity
0       Coke         20    250ml
1      Pepsi         30    300ml
2       7-up         25    150ml
3    Mirinda         25    100ml
4     Stoney         35    200ml
5  Diet Coke         45    250ml

In [66]:
pd.merge(product, product_update, how = 'outer')

    Products  Price  New_price Quantity
0       7-up   25.0         25    150ml
1       Coke   20.0         20    250ml
2  Diet Coke    NaN         45    250ml
3    Mirinda   25.0         25    100ml
4      Pepsi   30.0         30    300ml
5     Stoney   35.0         35    200ml

**Merging columns with different names**

In [83]:

product = pd.DataFrame({'Product': ['Coke', 'Pepsi', '7-up', 'Mirinda', 'Stoney'],
                     'Price': [20,30,25,25,35]})

product_update = pd.DataFrame({'Product_update': ['Coke', 'Pepsi', '7-up', 'Mirinda', 'Stoney', 'Diet Coke'],
                     'New_price': [20,30,25,25,35,45],
                     'Quantity': ['250ml', '300ml', '150ml', '100ml', '200ml', '250ml']})

In [80]:
pd.merge(product, product_update, how = 'inner', left_on='Product', right_on='Product_update')

   Product  Price Product_update  New_price Quantity
0     Coke     20           Coke         20    250ml
1    Pepsi     30          Pepsi         30    300ml
2     7-up     25           7-up         25    150ml
3  Mirinda     25        Mirinda         25    100ml
4   Stoney     35         Stoney         35    200ml

**Joining dfs using the .join() function**
Used for combining data on a key column or index

In [85]:
product = pd.DataFrame({'Product': ['Coke', 'Pepsi', '7-up', 'Mirinda', 'Stoney'],
                     'Price': [20,30,25,25,35]})

product_update = pd.DataFrame({'Product': ['Coke', 'Pepsi', '7-up', 'Mirinda', 'Stoney', 'Diet Coke'],
                     'New_price': [20,30,25,25,35,45],
                     'Quantity': ['250ml', '300ml', '150ml', '100ml', '200ml', '250ml']})

In [82]:
product.join(product_update, lsuffix = '_x', rsuffix = '_y')

  Product_x  Price Product_y  New_price Quantity
0      Coke     20      Coke         20    250ml
1     Pepsi     30     Pepsi         30    300ml
2      7-up     25      7-up         25    150ml
3   Mirinda     25   Mirinda         25    100ml
4    Stoney     35    Stoney         35    200ml

In [86]:
pd.merge(product, product_update, how = 'left', left_index = True, right_index = True)

  Product_x  Price Product_y  New_price Quantity
0      Coke     20      Coke         20    250ml
1     Pepsi     30     Pepsi         30    300ml
2      7-up     25      7-up         25    150ml
3   Mirinda     25   Mirinda         25    100ml
4    Stoney     35    Stoney         35    200ml

In [4]:
# Example 2

df1 = pd.read_csv('LOTR.csv')
df2 = pd.read_csv('LOTR2.csv')

In [5]:
df1

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [6]:
df2

   FellowshipID FirstName   Age
0          1001     Frodo    50
1          1002   Samwise    39
2          1006   Legolas  2931
3          1007    Elrond  6520
4          1008  Barromir    51

In [7]:
df1.merge(df2, how = 'inner', on = 'FellowshipID')

   FellowshipID FirstName_x     Skills FirstName_y  Age
0          1001       Frodo     Hiding       Frodo   50
1          1002     Samwise  Gardening     Samwise   39

In [8]:
df1.merge(df2, how = 'outer')

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding    50.0
1          1002   Samwise  Gardening    39.0
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
4          1006   Legolas        NaN  2931.0
5          1007    Elrond        NaN  6520.0
6          1008  Barromir        NaN    51.0

In [9]:
df1.merge(df2, how = 'left')

   FellowshipID FirstName     Skills   Age
0          1001     Frodo     Hiding  50.0
1          1002   Samwise  Gardening  39.0
2          1003   Gandalf     Spells   NaN
3          1004    Pippin  Fireworks   NaN

In [10]:
df1.merge(df2, how = 'right')

   FellowshipID FirstName     Skills   Age
0          1001     Frodo     Hiding    50
1          1002   Samwise  Gardening    39
2          1006   Legolas        NaN  2931
3          1007    Elrond        NaN  6520
4          1008  Barromir        NaN    51

In [16]:
# using .join() to merge DataFrames

df4 = df1.set_index('FellowshipID').join(df2.set_index('FellowshipID'), lsuffix = '_Left', rsuffix = '_Right', how = 'outer')
df4

             FirstName_Left     Skills FirstName_Right     Age
FellowshipID
1001                  Frodo     Hiding           Frodo    50.0
1002                Samwise  Gardening         Samwise    39.0
1003                Gandalf     Spells             NaN     NaN
1004                 Pippin  Fireworks             NaN     NaN
1006                    NaN        NaN         Legolas  2931.0
1007                    NaN        NaN          Elrond  6520.0
1008                    NaN        NaN        Barromir    51.0

In [21]:
pd.concat([df1, df2], ignore_index = True, join = 'inner')

   FellowshipID FirstName
0          1001     Frodo
1          1002   Samwise
2          1003   Gandalf
3          1004    Pippin
4          1001     Frodo
5          1002   Samwise
6          1006   Legolas
7          1007    Elrond
8          1008  Barromir